Avraham565/smart-kosher/panel/sdkconfig.defaults
# CrowPanel Advance 7" (ESP32-S3-WROOM-1-N16R8) — panel UI firmware
# ===================================================================
# PRODUCTION-CLEAN profile (Track A). This is the baseline you flash to
# judge real visual stability — no perf/sysmon/LVGL-logging, because the
# measurement tools are themselves per-frame load that moves the result.
# For numeric measurement build the diagnostic profile instead:
#     PANEL_PROFILE=diag bash panel/build.sh
# which layers sdkconfig.defaults.diag on top of this file.
# ===================================================================
CONFIG_IDF_TARGET="esp32s3"

# Flash: proven settings on this exact board (all MicroPython-era flashes)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Octal PSRAM (8MB) — RGB frame buffers live here
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# 64B data-cache line — foundational PSRAM cache geometry (fewer cache
# transactions per FB burst). Kept in Track A; it is not a drift plaster.
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# esp_lvgl_port recommendation
CONFIG_FREERTOS_HZ=1000

# --- Rendering: Track A (truly clean) ---
# Two full framebuffers in PSRAM + direct_mode + avoid_tearing (set in main.c).
# Nothing else. This is the honest, confound-free baseline we measure on.
# Diagnostic ladder if it drifts (ONE variable at a time, in this order):
#   1. drop pclk to 18 MHz (main.c) — relieve PSRAM fetch pressure at the root
#   2. Track B: bounce buffers + bb_mode — Espressif's RECOMMENDED structural
#      fix (decouples the LCD DMA deadline from PSRAM latency)
# CONFIG_LCD_RGB_RESTART_IN_VSYNC is deliberately NOT set: Espressif marks it
# "not recommended", it doesn't fix the root and can turn a smooth drift into
# per-frame micro-jumps + lower FPS. It masks the truth we're trying to read.
# LVGL defaults (33ms refresh) stay. Never set CONFIG_LV_DEF_REFR_PERIOD=10 or
# CONFIG_LV_DRAW_SW_ASM_CUSTOM (9.1-only).

# --- LVGL (managed component, configured via Kconfig) ---
CONFIG_LV_COLOR_DEPTH_16=y
# Hebrew / RTL
CONFIG_LV_USE_BIDI=y
CONFIG_LV_FONT_DEJAVU_16_PERSIAN_HEBREW=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_28=y
